In [5]:
import pandas as pd

In [6]:
df=pd.DataFrame({'Name':['Diksha','Kalyani','Ashawini','Ovi','Anavi'],'Age':[20,21,21,20,21],'Location':['Sangola','Barshi','Wagholi','Mumbai','Pune']},index=None)

In [7]:
df

       Name  Age Location
0    Diksha   20  Sangola
1   Kalyani   21   Barshi
2  Ashawini   21  Wagholi
3       Ovi   20   Mumbai
4     Anavi   21     Pune

In [8]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
df.dtypes

Name        object
Age          int64
Location    object
dtype: object

In [12]:
df.shape

(5, 3)

In [18]:
df.describe

<bound method NDFrame.describe of        Name  Age Location
0    Diksha   20  Sangola
1   Kalyani   21   Barshi
2  Ashawini   21  Wagholi
3       Ovi   20   Mumbai
4     Anavi   21     Pune>

In [23]:
df=pd.read_csv("Chocolate Sales (2).csv")

In [24]:
df.head(6)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04/01/2022,"$5,320.00",180
1,Van Tuxwell,India,85% Dark Bars,01/08/2022,"$7,896.00",94
2,Gigi Bohling,India,Peanut Butter Cubes,07/07/2022,"$4,501.00",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27/04/2022,"$12,726.00",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24/02/2022,"$13,685.00",184
5,Van Tuxwell,India,Smooth Sliky Salty,06/06/2022,"$5,376.00",38

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3282 entries, 0 to 3281
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sales Person   3282 non-null   object
 1   Country        3282 non-null   object
 2   Product        3282 non-null   object
 3   Date           3282 non-null   object
 4   Amount         3282 non-null   object
 5   Boxes Shipped  3282 non-null   int64
dtypes: int64(1), object(5)
memory usage: 154.0+ KB

In [26]:
df.describe()

       Boxes Shipped
count    3282.000000
mean      164.666971
std       124.024736
min         1.000000
25%        71.000000
50%       137.000000
75%       232.000000
max       778.000000

In [27]:
df.isnull()

      Sales Person  Country  Product   Date  Amount  Boxes Shipped
0            False    False    False  False   False          False
1            False    False    False  False   False          False
2            False    False    False  False   False          False
3            False    False    False  False   False          False
4            False    False    False  False   False          False
...            ...      ...      ...    ...     ...            ...
3277         False    False    False  False   False          False
3278         False    False    False  False   False          False
3279         False    False    False  False   False          False
3280         False    False    False  False   False          False
3281         False    False    False  False   False          False

[3282 rows x 6 columns]

In [28]:
df.iloc[1500]

Sales Person            Ches Bonnell
Country                       Canada
Product          Spicy Special Slims
Date                      05/08/2023
Amount                     $5,859.21
Boxes Shipped                    193
Name: 1500, dtype: object

In [29]:
df.dtypes

Sales Person     object
Country          object
Product          object
Date             object
Amount           object
Boxes Shipped     int64
dtype: object